<a href="https://colab.research.google.com/github/yardsale8/DSCI_210_R_notebooks/blob/main/lecture_6_2_three_programming_styles_and_types_of_programming_errors.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Three programming styles and Types of Programming Errors

In this notebook, we will

1. Identify three programming styles (imperative, functional, and piped),
2. Practice converting between these three styles, and
3. Discuss the different types of programming errors (name, syntax, and semantic).

## Always start by loading libraries and the data

In [2]:
library(tidyverse)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.3     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.3     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.0
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

In [4]:
surveys <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/portal_data_joined.csv')
head(surveys)

  record_id month day year plot_id species_id sex hindfoot_length weight
1   1        7    16  1977 2       NL         M   32              NA
2  72        8    19  1977 2       NL         M   31              NA
3 224        9    13  1977 2       NL             NA              NA
4 266       10    16  1977 2       NL             NA              NA
5 349       11    12  1977 2       NL             NA              NA
6 363       11    12  1977 2       NL             NA              NA
  genus   species  taxa   plot_type
1 Neotoma albigula Rodent Control
2 Neotoma albigula Rodent Control
3 Neotoma albigula Rodent Control
4 Neotoma albigula Rodent Control
5 Neotoma albigula Rodent Control
6 Neotoma albigula Rodent Control

## More on piping with `dplyr`

### Saving the result of a piped operation

#### Left-pointing assignment w/ standard style pipes

In [7]:
surveys_small <- surveys %>%
  filter(weight < 5) %>%
  select(species_id, sex, weight)

surveys_small %>% head

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

#### Right-pointing assignment with alterative style pipes (my preference)

In [8]:
(surveys
%>% filter(weight < 5)
%>% select(species_id, sex, weight)
) -> survey_small

surveys_small %>% head

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

### The advantages of piping

* reads left-to-right
* reads top-to-bottom
* Focuses on verbs
* Removes pointless nouns

## Three programming styles.

* **Imperative.** Save the result of each action in a new variable.
* **Functional.** Apply functions, to functions, ..., to the data.
* **Piping.** Pipe the data through a series of functions.

### Imperative:

In [9]:
x <- pi
r_x <- round(x, 2)
c_x <- as.character(r_x)
c_x

[1] "3.14"

### Functional:

In [10]:
as.character(round(pi, 2))

[1] "3.14"

### Piping:

In [13]:
pi %>%
  round(2) %>%
  as.character

[1] "3.14"

In [12]:
(pi
 %>% round(2)
 %>% as.character
)

[1] "3.14"

## Example 1 - Converting to imperative code to pipes

In [15]:
surveys_small <- filter(surveys, weight < 5)
survey_small_id_sex_wgt <- select(surveys_small, species_id, sex, weight)
head(survey_small_id_sex_wgt)

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

In [ ]:
# Convert to piped code

## Example 2 - Converting to piped code to the imperative style

In [ ]:
surveys_small <- surveys %>%
  filter(species_id == 'NL') %>%
  select(species_id, sex, weight)

head(surveys_small)

  species_id sex weight
1 NL         M   NA
2 NL         M   NA
3 NL             NA
4 NL             NA
5 NL             NA
6 NL             NA

In [ ]:
# Convert to imperative

## Example 3 - Converting to piped code to the functional style

In [ ]:
surveys_small <- surveys %>%
  filter(weight < 5) %>%
  select(species_id, sex, weight)

head(surveys_small)

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

In [ ]:
# Convert to imperative

## <font color="red"> Exercise 1 </font>

Perform each of the following code conversions.

In [ ]:
sales <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/auto_sales.csv')
head(sales)

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

#### <font color="red">TASK 1</font>. Convert the following *piped code* to the *imperative style*

In [ ]:
sales %>%
    select(Salesperson, Compact, Sedan) %>%
    mutate(Car = Compact + Sedan)

  Salesperson Compact Sedan Car
1 Ann         22      18    40
2 Bob         19      12    31
3 Yolanda     19       8    27
4 Xerxes      12      23    35

In [ ]:
# Your code here

#### <font color="red">TASK 2</font>. Convert the following *imperative code* to the *piped style*

In [ ]:
df2 <- mutate(sales, Car = Compact + Sedan)
df3 <- mutate(df2, Utility = SUV + Truck)
df4 <- select(df3, Salesperson, Car, Utility)
head(df4)

  Salesperson Car Utility
1 Ann         40  27
2 Bob         31  37
3 Yolanda     27  47
4 Xerxes      35  27

In [ ]:
# Your code here

Types of programming errors
========================================================

* Name errors
* Syntax errors
* Semantic errors (hardest/worst)

### Name Errors - Using the wrong name

In [ ]:
sales <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/data/auto_sales.csv')
head(sales)

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

##  Find the name errors

In [ ]:
sales %>%
  select(salesperson, sedan)

ERROR: Error: Can't subset columns that don't exist.
✖ Column `salesperson` doesn't exist.

### Syntax errors - Incorrect syntax

In [ ]:
head(sales

ERROR: Error in parse(text = x, srcfile = src): <text>:2:0: unexpected end of input
1: head(sales
   ^

##  Find the syntax errors

In [ ]:
# Find the syntax error
sales %>%
  mutate(monthly_sedan = Sedan/3,
         monthly_suv = SUV/3
         monthly_truck = Truck/3

ERROR: Error in parse(text = x, srcfile = src): <text>:5:10: unexpected symbol
4:          monthly_suv = SUV/3
5:          monthly_truck
            ^

### Semantic Errors - Code runs, wrong results

In [ ]:
# Find the semantic errors
sales %>%
  group_by(Salesperson) %>%
  mutate(avg_sedan = median(Truck))

  Salesperson Compact Sedan SUV Truck avg_sedan
1 Ann         22      18    15  12    12
2 Bob         19      12    17  20    20
3 Yolanda     19       8    32  15    15
4 Xerxes      12      23    18   9     9

## <font color="red"> Exercise 3 </font>

Identify all of the errors and classify each as either a name, syntax, or semantic error.

In [ ]:
sales %>%
    mutate(Car = compact + sedan) %>%
    mutate(Utility = SUV * Truck %>%

ERROR: Error in parse(text = x, srcfile = src): <text>:4:0: unexpected end of input
2:     mutate(Car = compact + sedan) %>%
3:     mutate(Utility = SUV * Truck %>%
  ^

> Your answer here